// 肉鸽主题
export const enum RogueTheme {
  Phantom = 'Phantom', // 傀影
  Mizuki = 'Mizuki', // 水月
  Sami = 'Sami', //萨米
}

export type PhantomSquadType =
  | '指挥分队'
  | '集群分队'
  | '后勤分队'
  | '矛头分队'
  | '突击战术分队'
  | '堡垒战术分队'
  | '远程战术分队'
  | '破坏战术分队'
  | '研究分队'
  | '高规格分队'

export type MizukiSquadType =
  | '心胜于物分队'
  | '物尽其用分队'
  | '以人为本分队'
  | '指挥分队'
  | '集群分队'
  | '后勤分队'
  | '矛头分队'
  | '突击战术分队'
  | '堡垒战术分队'
  | '远程战术分队'
  | '破坏战术分队'
  | '研究分队'
  | '高规格分队'

export type SamiSquadType =
  | '指挥分队'
  | '集群分队'
  | '后勤分队'
  | '特训分队'
  | '矛头分队'
  | '突击战术分队'
  | '堡垒战术分队'
  | '远程战术分队'
  | '破坏战术分队'
  | '高规格分队'
  | '永恒狩猎分队'
  | '生活至上分队'
  | '科学主义分队'

export type RolesType = '稳扎稳打' | '取长补短' | '随心所欲' | '先手必胜'
